cfg/InformationRegisters/ПараметрыПлатежныхДокументовПоВзносамВФонды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыПлатежныхДокументовПоВзносамВФонды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетКонтрагента</Name>
					<Comment>(Общ) Банковский счет контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяНалоговойДекларации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Налоги</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиНалоговыхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/InformationRegisters/ШкалаСтавокНалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ШкалаСтавокНалогов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатьяНалоговойДекларации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиНалоговыхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порог</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаПолная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Налог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Налоги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПорога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорогиШкалыСтавокНалогов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/InformationRegisters/ОтражениеВзносовВРеглУчете.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ОтражениеВзносовВРеглУчете</Name>
			<Comment>(регл.)</Comment>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВРеглУчете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Налог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Налоги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/InformationRegisters/ПараметрыПлатежныхДокументовПоВзносамВФонды/Forms/ФормаСписка/Ext/Form/Module.bsl
Процедура УстановитьОтборПоОрганизации()
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		ЗначениеИзСписка = ЭлементыФормы.Организация.Значение;
		РегистрСведенийСписок.Отбор.Организация.Использование = Истина;
		РегистрСведенийСписок.Отбор.Организация.ВидСравнения = ВидСравнения.Равно;
		РегистрСведенийСписок.Отбор.Организация.Значение = ЗначениеИзСписка;
		
	Иначе
		
		РегистрСведенийСписок.Отбор.Организация.Использование = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры
	
Процедура ОрганизацияПриИзменении(Элемент)
	УстановитьОтборПоОрганизации();
КонецПроцедуры

Процедура ДействияФормыЗаполнить(Кнопка)
	
	// список взносов
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("парамДата", ТекущаяДата());
	Запрос.УстановитьПараметр("парамОрганизация", Организация);
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Шкала.СтатьяНалоговойДекларации.Родитель КАК Родитель,
	|	Отражение.СпособОтраженияВРеглУчете.СчетКт КАК СчетУчета
	|ИЗ РегистрСведений.ШкалаСтавокНалогов.СрезПоследних(&парамДата) КАК Шкала
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтражениеВзносовВРеглУчете КАК Отражение
	|По		Шкала.Налог = Отражение.Налог
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыПлатежныхДокументовПоВзносамВФонды КАК Параметры
	|По		Параметры.СтатьяНалоговойДекларации = Шкала.СтатьяНалоговойДекларации
	|	И	Параметры.Организация = &парамОрганизация
	|ГДЕ	Шкала.СтатьяНалоговойДекларации.Родитель ЕСТЬ НЕ NULL
	|	И	Отражение.СпособОтраженияВРеглУчете.СчетКт ЕСТЬ НЕ NULL
	|
	|// НДФЛ
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	NULL КАК Родитель,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоНДФЛ)
	|ИЗ РегистрСведений.ШкалаСтавокНалогов.СрезПоследних(&парамДата) КАК Шкала
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыПлатежныхДокументовПоВзносамВФонды КАК Параметры
	|По		Параметры.СтатьяНалоговойДекларации ЕСТЬ NULL
	|	И	Параметры.Организация = &парамОрганизация
	|ГДЕ   Параметры.Организация ЕСТЬ NULL
	|";
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.ПараметрыПлатежныхДокументовПоВзносамВФонды.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Организация = Организация;
		МенеджерЗаписи.СтатьяНалоговойДекларации = Выборка.Родитель;
		МенеджерЗаписи.СчетУчета = Выборка.СчетУчета;
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
	// Военный сбор
	МенеджерЗаписи = РегистрыСведений.ПараметрыПлатежныхДокументовПоВзносамВФонды.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Организация = Организация;
	МенеджерЗаписи.СтатьяНалоговойДекларации = Справочники.Налоги.ВоенныйСбор;
	МенеджерЗаписи.СчетУчета = ПланыСчетов.Хозрасчетный.РасчетыПоОбязательнымПлатежам;
	МенеджерЗаписи.Записать();

	
КонецПроцедуры

Процедура РегистрСведенийСписокКонтрагентПриИзменении(Элемент)
	ЭлементыФормы.РегистрСведенийСписок.ТекущиеДанные.СчетКонтрагента = Элемент.Значение.ОсновнойБанковскийСчет;
КонецПроцедуры
